is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecm064.h
#define _RNGNUMGEN1_RNG_POSITION                 0x00000000
#define _RNGNUMGEN1_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN1_RNG_LENGTH                   0x00000020

#define _RNGNUMGEN2_RNG_POSITION                 0x00000000
#define _RNGNUMGEN2_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN2_RNG_LENGTH                   0x00000020

#define _RNGSEED1_SEED_POSITION                  0x00000000
#define _RNGSEED1_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED1_SEED_LENGTH                    0x00000020

#define _RNGSEED2_SEED_POSITION                  0x00000000
#define _RNGSEED2_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED2_SEED_LENGTH                    0x00000020

#define _RNGCNT_RCNT_POSITION                    0x00000000
#define _RNGCNT_RCNT_MASK                        0x0000007F
#define _RNGCNT_RCNT_LENGTH                      0x00000007

#define _SBFLAG_T0PGV_POSITION                   0x00000000
#define _SBFLAG_T0PGV_MASK                       0x00000001
#define _SBFLAG_T0PGV_LENGTH                     0x00000001

#define _SBFLAG_T1PGV_POSITION                   0x00000001
#define _SBFLAG_T1PGV_MASK                       0x00000002
#define _SBFLAG_T1PGV_LENGTH                     0x00000001

#define _SBFLAG_T2PGV_POSITION                   0x00000002
#define _SBFLAG_T2PGV_MASK                       0x00000004
#define _SBFLAG_T2PGV_LENGTH                     0x00000001

#define _SBFLAG_T3PGV_POSITION                   0x00000003
#define _SBFLAG_T3PGV_MASK                       0x00000008
#define _SBFLAG_T3PGV_LENGTH                     0x00000001

#define _SBFLAG_T4PGV_POSITION                   0x00000004
#define _SBFLAG_T4PGV_MASK                       0x00000010
#define _SBFLAG_T4PGV_LENGTH                     0x00000001

#define _SBFLAG_T5PGV_POSITION                   0x00000005
#define _SBFLAG_T5PGV_MASK                       0x00000020
#define _SBFLAG_T5PGV_LENGTH                     0x00000001

#define _SBFLAG_T6PGV_POSITION                   0x00000006
#define _SBFLAG_T6PGV_MASK                       0x00000040
#define _SBFLAG_T6PGV_LENGTH                     0x00000001

#define _SBFLAG_T7PGV_POSITION                   0x00000007
#define _SBFLAG_T7PGV_MASK                       0x00000080
#define _SBFLAG_T7PGV_LENGTH                     0x00000001

#define _SBFLAG_T8PGV_POSITION                   0x00000008
#define _SBFLAG_T8PGV_MASK                       0x00000100
#define _SBFLAG_T8PGV_LENGTH                     0x00000001

#define _SBFLAG_T9PGV_POSITION                   0x00000009
#define _SBFLAG_T9PGV_MASK                       0x00000200
#define _SBFLAG_T9PGV_LENGTH                     0x00000001

#define _SBFLAG_T10PGV_POSITION                  0x0000000A
#define _SBFLAG_T10PGV_MASK                      0x00000400
#define _SBFLAG_T10PGV_LENGTH                    0x00000001

#define _SBFLAG_T11PGV_POSITION                  0x0000000B
#define _SBFLAG_T11PGV_MASK                      0x00000800
#define _SBFLAG_T11PGV_LENGTH                    0x00000001

#define _SBFLAG_T12PGV_POSITION                  0x0000000C
#define _SBFLAG_T12PGV_MASK                      0x00001000
#define _SBFLAG_T12PGV_LENGTH                    0x00000001

#define _SBFLAG_T13PGV_POSITION                  0x0000000D
#define _SBFLAG_T13PGV_MASK                      0x00002000
#define _SBFLAG_T13PGV_LENGTH                    0x00000001

#define _SBT0ELOG1_CMD_POSITION                  0x00000000
#define _SBT0ELOG1_CMD_MASK                      0x00000007
#define _SBT0ELOG1_CMD_LENGTH                    0x00000003

#define _SBT0ELOG1_REGION_POSITION               0x00000004
#define _SBT0ELOG1_REGION_MASK                   0x000000F0
#define _SBT0ELOG1_REGION_LENGTH                 0x00000004

#define _SBT0ELOG1_INITID_POSITION               0x00000008
#define _SBT0ELOG1_INITID_MASK                   0x0000FF00
#define _SBT0ELOG1_INITID_LENGTH                 0x00000008

#define _SBT0ELOG1_CODE_POSITION                 0x00000018
#define _SBT0ELOG1_CODE_MASK                     0x0F000000
#define _SBT0ELOG1_CODE_LENGTH                   0x00000004

#define _SBT0ELOG1_MULTI_POSITION                0x0000001F
#define _SBT0ELOG1_MULTI_MASK                    0x80000000
#define _SBT0ELOG1_MULTI_LENGTH                  0x00000001

#define _SBT0ELOG2_GROUP_POSITION                0x00000000
#define _SBT0ELOG2_GROUP_MASK                    0x00000003
#define _SBT0ELOG2_GROUP_LENGTH                  0x00000002

#define _SBT0ECON_ERRP_POSITION                  0x00000018
#define _SBT0ECON_ERRP_MASK                      0x01000000
#define _SBT0ECON_ERRP_LENGTH                    0x00000001

#define _SBT0ECLRS_CLEAR_POSITION                0x00000000
#define _SBT0ECLRS_CLEAR_MASK                    0x00000001
#define _SBT0ECLRS_CLEAR_LENGTH                  0x00000001

#define _SBT0ECLRM_CLEAR_POSITION                0x00000000
#define _SBT0ECLRM_CLEAR_MASK                    0x00000001
#define _SBT0ECLRM_CLEAR_LENGTH                  0x00000001

#define _SBT0REG0_SIZE_POSITION                  0x00000003
#define _SBT0REG0_SIZE_MASK                      0x000000F8
#define _SBT0REG0_SIZE_LENGTH                    0x00000005

#define _SBT0REG0_PRI_POSITION                   0x00000009
#define _SBT0REG0_PRI_MASK                       0x00000200
#define _SBT0REG0_PRI_LENGTH                     0x00000001

#define _SBT0REG0_BASE_POSITION                  0x0000000A
#define _SBT0REG0_BASE_MASK                      0xFFFFFC00
#define _SBT0REG0_BASE_LENGTH                    0x00000016

#define _SBT0RD0_GROUP0_POSITION                 0x00000000
#define _SBT0RD0_GROUP0_MASK                     0x00000001
#define _SBT0RD0_GROUP0_LENGTH                   0x00000001

#define _SBT0RD0_GROUP1_POSITION                 0x00000001
#define _SBT0RD0_GROUP1_MASK                     0x00000002
#define _SBT0RD0_GROUP1_LENGTH                   0x00000001

#define _SBT0RD0_GROUP2_POSITION                 0x00000002
#define _SBT0RD0_GROUP2_MASK                     0x00000004
#define _SBT0RD0_GROUP2_LENGTH                   0x00000001

